Домашнее задание к работе 2 (Вариант 15)
Условие задачи
Стоимость погонного метра красного шелка составляет X золотых. Сколько заплатил Грей за ткань для своей бригантины, если общая площадь парусов на ней равна S м², а ширина ткани в рулоне — L см.
1. Алгоритм и блок‑схема
Алгоритм:
1.	Начало.
2.	Ввести X — стоимость погонного метра ткани (золотых).
3.	Ввести S — общую площадь парусов (м²).
4.	Ввести L — ширину ткани (см).
5.	Вычислить ширину ткани в метрах: width = L / 100.
6.	Вычислить необходимую длину ткани: length = S / width.
7.	Вычислить стоимость: cost = length × X.
8.	Вывести полученную стоимость.
9.	Конец.
Блок‑схема:
Блок-схема

2. Реализация программы
#include <stdio.h>
#include <locale.h>

int main(void) {
    setlocale(LC_CTYPE, "ru_RU.utf8");
    double X, S, L;
    printf("Введите стоимость погонного метра ткани (X): ");
    scanf("%lf", &X);
    printf("Введите общую площадь парусов (S, м²): ");
    scanf("%lf", &S);
    printf("Введите ширину ткани (L, см): ");
    scanf("%lf", &L);

    double width = L / 100.0;
    double length = S / width;
    double cost = length * X;

    printf("Необходимая длина ткани: %.2f м\n", length);
    printf("Стоимость ткани: %.2f золотых\n", cost);

    return 0;
}
3. Результаты работы программы
Пример:
Входные данные:
X = 10
S = 50
L = 100
Вывод программы:
Введите стоимость погонного метра ткани (X): 10
Введите общую площадь парусов (S, м²): 50
Введите ширину ткани (L, см): 100
Необходимая длина ткани: 50.00 м
Стоимость ткани: 500.00 золотых
________________________________________
